# 数据类型

# 整型(Integer)：Fixnum -2^30 到 2^30-1  /  Bignum  大于等于2^30

a1 = 0377  #  其他进制表示：0-octal，0x-hex，0b-binary
a2 = 0xff
a3 = 0b1011

a4 = 1_123  #  下划线字符在数字字符串中被忽略
a5 = "a".ord #  可以一个 ASCII 字符或一个用问号标记的转义序列的整数值。
a6 = ?\n

puts a1,a2,a3,a4,a5,a6
puts "=========================="
# 整型字面量 （literal）：代码中能见到的值，数值，bool值，字符串等都叫字面量
a1=0

#带千分符的整型
a2=1_000_000

#其它进制的表示
a3=0xa
puts a1,a2,a3
puts "=========================="
#===================================================================================
# 浮点型
# Ruby 支持浮点数。它们是带有小数的数字。浮点数是类 Float 的对象，且可以是下列中任意一个。

f1 = 1.2
f2 = 1.0e6
f3 = 4e10
f4 = 4e+10
puts f1,f2,f3,f4
puts "=========================="

#算术操作 :加减乘除操作符：+-*/；指数操作符为** ,指数不必是整数
# ===================================================================================
# 字符串类型
# Ruby 字符串简单地说是一个 8 位字节序列，它们是类 String 的对象。
# 双引号标记的字符串允许替换和使用反斜线符号，单引号标记的字符串不允许替换，且只允许使用 \\ 和 \' 两个反斜线符号。
puts 'escape using "\"'
puts 'That\'s right'
# Ruby 支持的反斜线符号：\n \r \b ....
puts "相乘：#{1*2}" #使用序列 #{ expr } 替换任意 Ruby 表达式的值为一个字符串
name = "ruby"
puts name
puts "#{name+" is good"}"
puts "=========================="
# ===================================================================================
# 数组
# 数组字面量通过[]中以逗号分隔定义，且支持range定义。
#     （1）数组通过[]索引访问
#     （2）通过赋值操作插入(?)、删除(?)、替换元素
#     （3）通过+，－号进行合并和删除元素，且集合做为新集合出现(?)
#     （4）通过<<号向原数据追加元素
#     （5）通过*号重复数组元素
#     （6）通过｜和&符号做并集和交集操作（注意顺序）(?)
ary = [ "fred", 10, 3.14, "This is a string", "last element", ]
puts ary[1]
ary[1] = 20
puts ary[1]

ary<<100
print ary,"\n"

print ary*2,"\n"

x = [1,2,3,4,5,],y = [4,5,6,]
print x+y,"\n"
print x-y,"\n"
print x|y,"\n"
print x&y,"\n"
puts "=========================="
# ===================================================================================
# 哈希类型
# Ruby 哈希是在大括号内放置一系列键/值对，键和值之间使用逗号和序列 => 分隔。尾部的逗号会被忽略。

h = {1=>"a",2=>"b"}
print h
puts "=========================="
# ===================================================================================
# 范围类型
#
# 一个范围表示一个区间。
# 范围是通过设置一个开始值和一个结束值来表示。范围可使用 s..e 和 s...e 来构造，或者通过 Range.new 来构造。
#
# 使用 .. 构造的范围从开始值运行到结束值（包含结束值）。使用 ... 构造的范围从开始值运行到结束值（不包含结束值）。当作为一个迭代器使用时，范围会返回序列中的每个值。
#
# 范围 (1..5) 意味着它包含值 1, 2, 3, 4, 5，范围 (1...5) 意味着它包含值 1, 2, 3, 4 。

(10..15).each do |n|
  print n, ' '
end