# 大多数运算符实际上是方法调用。
# 例如，a + b 被解释为 a.+(b)，其中指向变量 a 的 + 方法被调用，b 作为方法调用的参数。
# ===============================================================================
# 四类相等比较：https://www.cnblogs.com/wf0117/p/9022603.html
# ===============================================================================
# 使用并行赋值可以更快地声明：
# a, b, c = 10, 20, 30
#
# 并行赋值在交换两个变量的值时也很有用：
# a, b = b, c
# ===============================================================================
# 使用 ".." 和 "..." 范围运算符来创建的。两点形式创建的范围包含起始值和结束值，
# 三点形式创建的范围只包含起始值不包含结束值。
# ===============================================================================
# defined? 是一个特殊的运算符，以方法调用的形式来判断传递的表达式是否已定义。
# 它返回表达式的描述字符串，如果表达式未定义则返回 nil
#
# defined? super   如果存在可被 super 用户调用的方法，则为 True
# defined? yield   如果已传递代码块，则为 True

v1 = 10
$v2 = 20
puts defined? v1
puts defined? $v2
puts defined? v3
puts defined? puts
puts defined? puts(a)
puts defined? yield